Repository: duniter/blog-posts
Catalog: posts/2015-08-11-faq.*.po
Languages: fr_fr

source: # FAQ
fr_fr: # Foire aux questions

source: ## General aspects
fr_fr: ## Aspects généraux

source: ### uCoin in 3 words?
fr_fr: ### uCoin en trois mots ?

source: Free Currency System.
fr_fr: Système Monétaire Libre.

source: ### Free currency?
fr_fr: ### Monnaie libre ?

source: This is a new expression, as no free currency existed before: free currency is one [respecting 4 economical freedoms](http://ucoin.io/theoretical/#a-free-economy), and leading to apply _Universal Dividend_ to its members.
fr_fr: Il s’agit d’une expression nouvelle, aucune monnaie libre n'a encore vu le jour : une monnaie libre [respecte les quatre libertés économiques](http://ucoin.io/theoretical/#uneeconomielibre), et menant à la co-production d 'un_dividende universel_ par ses membres.

source: ### Universal Dividend?
fr_fr: ### Dividende Universel ?

source: This is a special case of [Basic Income](http://www.wikiwand.com/en/Basic_income): an amount every individual receives on a regular basis (monthly, annualy, ...) without other condition than being a unique living member of the Community. **This is not a redistribution system**. This is a _currency system_ where money is directly issued _by_ individuals and _to_ individuals.
fr_fr: C'est un cas particulier de [Revenu de Base](https://www.wikiwand.com/fr/Revenu_de_base) : un montant que tout individu reçoit sur une base régulière (mensuelle, annuelle,...) sans autre condition que d'être un membre unique et vivant dans la communauté. **Ce n'est pas un système de redistribution**. C'est un __système monétaire__ où la monnaie est directement émise __par__ les individus __pour__ les individus.

source: ### How to achieve this?
fr_fr: ### Comment réaliser cet objectif ?

source: uCoin uses cryptography features provided by [Ed25519](http://www.wikiwand.com/en/EdDSA) scheme to both:
fr_fr: uCoin utilise des fonctionnalités de chiffrement fournies par le l'implémentation [Ed25519](https://www.wikiwand.com/fr/EdDSA) des courbes elliptiques d'Edwards qui permet à la fois :

source: Identify unique & living individuals (a.k.a _members_ of the monetary community)
fr_fr: d’identifier des individus uniques et vivants (soit, des __membres__ de la communauté monétaire)

source: Allow money transfers through digital signatures
fr_fr: de permettre des transferts monétaires grâce aux signatures numériques

source: ### Is uCoin like Bitcoin?
fr_fr: ### Est-ce que uCoin est comme Bitcoin ?

source: Well, uCoin is a _[cryptocurrency](http://www.wikiwand.com/en/Cryptocurrency)_ system and so is Bitcoin. Plus, both systems use [Proof of Work](http://ucoin.io/faq/#http://en.wikipedia.org/wiki/Proof-of-work_system) (PoW) technology to synchronize & secure its data. But uCoin takes advantage of [Web of Trust](http://www.wikiwand.com/en/Web_of_trust) mechanisms for both applying _Universal Dividend_ and considerably save energy power compared to Bitcoin.
fr_fr: À vrai dire, uCoin est une __[cryptomonnaie](https://www.wikiwand.com/fr/Crypto-monnaie)__ de la même manière que l'est Bitcoin. De plus, les deux systèmes utilisent la technologie de la [Preuve de travail](https://www.wikiwand.com/fr/Preuve_de_travail) pour synchroniser et sécuriser les données. Cependant, uCoin utilise le mécanisme de [Toile de Confiance](https://www.wikiwand.com/fr/Toile_de_confiance) pour à la fois distribuer le dividende universel et économiser considérablement de l'énergie par rapport à Bitcoin.

source: ### Still using Proof of Work?
fr_fr: ### Est-ce que la Preuve de Travail est toujours utilisée ?

source: Yes, PoW is still here. But in a largely lower order of magnitude. _Really_.
fr_fr: Oui, la Preuve de Travail est toujours présente. Mais d'un ordre de magnitude bien moindre. _Vraiment_.

source: ### What is a Web of Trust?
fr_fr: ### Qu’est-ce que la Toile de Confiance ?

source: Web of Trust refers to a data structure allowing people to trust each others' identity. In uCoin, it is exactly the same.
fr_fr: La Toile de Confiance fait référence à une structure de données permettant aux gens d'avoir confiance dans l'identité des autres. Dans uCoin, c'est exactement pareil.

source: ### Is uCoin data encrypted?
fr_fr: ### Est-ce que les données sont chiffrées dans uCoin ?

source: No, all uCoin data is public & replicated. Anyone using uCoin may have a complete copy of the database including both community & transactions.
fr_fr: Non, toutes les données uCoin sont publiques et répliquées. Tout le monde peut utiliser uCoin et obtenir une copie complète de la base de donnée, y compris les données de communauté et les transactions.

source: ## uCoin for simple users
fr_fr: ## uCoin pour les utilisateurs

source: ### Who can use uCoin?
fr_fr: ### Qui peut utiliser uCoin ?

source: Everybody: an individual, a collective (company, association, ...), there is no restriction here.
fr_fr: Tout le monde : un individu, un collectif (une entreprise, une association…), il n'y a absolument aucune restriction.

source: ### Why becoming a member?
fr_fr: ### Pourquoi devenir membre ?

source: Members are a different kind of users: they have special rights such as creating money & write new data in uCoin system. Members are the pillar of uCoin data.
fr_fr: Les membres sont un type spécial d'utilisateur : ils ont des droits particuliers comme celui de créer de la monnaie et d'écrire de nouvelles données dans le système. Les membres sont le pilier des données uCoin.

source: ### Who can become a member?
fr_fr: ### Qui peut devenir membre ?

source: _Only_ individuals, more precisely: **unique and living human beings**.
fr_fr: _Seulement_ des individus, plus précisément : **des êtres humains vivants et uniques**.

source: ### How to subscribe?
fr_fr: ### Comment s’inscrire ?

source: Newcomers (individual not members yet) have to create their own key, attach an identity to it, and get certified by existing members. Once done, they can simply express their will to join the Web of Trust for the system to accept it.
fr_fr: Les nouveaux (individus qui ne sont pas encore membres) peuvent créer leur propre clé, l'attacher à leur identité, et être certifiés par des membres existants. Finalement, ils n'ont plus qu'à émettre une demande d'adhésion sur Toile de Confiance pour que le système les accepte.

source: ### What is Web of Trust?
fr_fr: ### Qu’est-ce que la Toile de Confiance ?

source: Web of Trust (WoT) is a special data structure composed of entities on one hand, and links between them on the other hand. In uCoin, these _entities_ are inviduals while _links_ are certification of an individual's identity by another one. When an individual gets enough links from existing WoT, he then becomes eligible for joining the WoT: when this happens, his identity is considered as _trustable_. If individual then express its will to join the WoT, he becomes a _member_.
fr_fr: La Toile de Confiance (souvent notée WoT, pour Web of Trust en anglais) est une structure de données particulière. Elle est composée d'entitées d'une part, et de liens entre elles d'autre part. Dans uCoin, ces __entités__ sont des individus tandis que les __liens__ sont des certifications d'un individu par un autre. Quand un individu obtient assez de liens pour exister dans la WoT, il devient éligible pour rejoindre la toile. Quand ça arrive, son identité est considérée comme "de _confiance_". Si l'individu demande à rejoindre la WoT, il devient un _membre_.

source: ### Which are rules of Web of Trust?
fr_fr: ### Quelles sont les règles de la Toile de Confiance ?

source: Joining the Web of Trust requires to fit 3 conditions:
fr_fr: Rejoindre la Toile de Confiance se fait sous trois conditions :

source: an identity must gathers a minimum number of links
fr_fr: une identité doit obtenir un nombre minimum de liens

source: an identity cannot have twice a same link for a given period
fr_fr: une identité ne peut pas avoir deux fois le même lien pour une période déterminée

source: an identity must be between [0, maxStep] distance from any other identity
fr_fr: une identité doit être à une distance [0, pasMaximum] de toutes les autres identités

source: Where:
fr_fr: Où :

source: step _0_ is the identity itself
fr_fr: Le pas _0_ est l'identité même

source: step _n _is an identity directly known by step _n-1_
fr_fr: Le pas _n_ est une identité directement connue du pas _n-1_

source: ### How to receive Universal Dividend?
fr_fr: ### Comment recevoir le Dividende Universel ?

source: You have to be a member of the WoT when Universal Dividend (UD) is being written.
fr_fr: Il faut devenir un membre de la WoT quand le Dividende Universel (DU) est inscrit.

source: ### How is decided UD amount?
fr_fr: ### Comment décider du montant du DU ?

source: The amount is currency specific. But a general rule is defined in uCoin protocol:
fr_fr: Le montant est spécifique à chaque monnaie. De manière générale, dans le protocole uCoin :

source: The value of the parameters _c_, _UD(0) _and _dt_ are to be chosen by the implementation currency. For example, it could be:
fr_fr: Les valeurs des paramètres _c_, _DU(0)_ et _dt_ sont à choisir lors de l'implémentations de la monnaie. Par exemple, cela pourrait être :

source: > c = 0.0036815 UD(0) = 100 dt ~= 2 weeks
fr_fr: > c = 0.0036815 DU(0) = 100 dt ~= 2 semaines

source: to lead to a 9.22% annual « c », but issued through 2 weeks chunks.
fr_fr: ce qui mène à un « c » annuel de 9,22 %, mais émis toutes les deux semaines.

source: <div class="ui info message">Note: 9.22% annual « c » is a central symmetry between generations of 80 years life expectancy members. Those results may be found in the [RMT](http://wiki.creationmonetaire.info/images/f/f8/TRM_2_718_b.pdf).</div>
fr_fr: Note : un « c » annuel de 9,22 % permet une symétrie centrale entre des générations d'espérance de vie de 80 ans. Ces résultats peuvent être trouvés dans la [TRM](http://wiki.creationmonetaire.info/images/f/f8/TRM_2_718_b.pdf).

source: ### How to know if I received UD?
fr_fr: ### Comment recevoir le DU ?

source: If you were in WoT when UD was written, then you received it. It is just the protocol's rule.
fr_fr: Si vous êtes dans la WOT quand le DU est inscrit, vous le recevez. C'est la règle inscrite dans le protocole.

source: ### How to create money from UD?
fr_fr: ### Comment créer de la monnaie via les DU ?

source: If you received UD, then you are allowed to create money for an amount _exactly equal_ to the UD. As a consequence: as long as you do not create it, the money resulting from UD won't exist in the monetary mass.
fr_fr: Si vous recevez un DU, vous êtes autorisés à créer un montant monétaire _strictement égal_ à ce DU. En conséquence de quoi, tant que vous n'en créez pas, la monnaie résultante du DU n'existera pas dans la masse monétaire.

source: ### How to transfer money?
fr_fr: ### Comment transférer de la monnaie ?

source: You can transfer money by using _Transactions_. Transactions are just like cheques: you write who is the issuer, the recipient, and send it to the network. When it is validated, money has been transfered. However, transactions can do more than simple cheque: it may have any number of sources (minimum 1) and any number of recipients (minimum 1). Also, it exists 2 different transaction sources:
fr_fr: Vous pouvez transférer de la monnaie en utilisant les _Transactions_. Les Transactions sont comme un chèque, vous inscrivez l'émetteur, le destinataire, et l'envoyez au réseau. Quand il est validé, la monnaie est considérée comme transférée. Cependant les transactions sont plus qu'un simple chèque : vous pourriez avoir n'importe quel nombre de sources (minimum de 1) et de destinataires (minimum de 1). Enfin, il existe 2 types de sources pour les transactions :

source: other transactions
fr_fr: d'autres transactions

source: Universal Dividend
fr_fr: des Dividendes Universels

source: ### What about non-members?
fr_fr: ### Et à propos des non-membres ?

source: Non-members cannot receive UD, nor benefit from transaction fees. However, they can use transactions to receive & send money to their accounts.
fr_fr: Les non-membres ne peuvent pas recevoir de DU, et ne peuvent bénéficier des taxes sur les transactions. Cependant, ils peuvent utiliser les transactions pour recevoir et envoyer de la monnaie via leurs comptes.

source: ### How to know an individual is a member?
fr_fr: ### Comment savoir si un individu est membre ?

source: At any moment, the common data structure of uCoin (the _blockchain_) allows to know it: membership is simply written in it. Anyone may check it.
fr_fr: À tout moment, la structure de donnée publique de uCoin (la _blockchain_) vous permet de le savoir : les adhésions y sont simplement écrites. N'importe qui peut le vérifier.

source: ### How is it ensured no member can cheat by having multiple accounts?
fr_fr: ### Comment s’assurer que personne ne triche en possédant plusieurs comptes ?

source: This is all due to Web of Trust mechanisms. Without being magic, these mechanisms deeply depends on the rules of the WoT. In uCoin, WoT rules ensures that the more members the WoT is constituted, the harder it is for fake accounts to stay in. Thus, even if few fake accounts can exist at the beginning (which is already hard since the more little is WoT, the closer are members), these accounts will tend to be mechanically excluded. So, it cannot be guaranteed yet that fake identities won't exist. Maybe some mathematics could help us, we do not know yet (but you might help). What we are sure however, is that since only few fake accounts seems to be able to exist, this drawback does not stand in front of the benefits of free currency & free economy.
fr_fr: C'est grâce aux mécanismes de la Toile de Confiance. Sans être magiques, ces mécanismes dépendent profondément des règles utilisées dans la WoT. Les règles assurent que plus il y a de membres présents dans la WoT, plus il est difficile pour des faux comptes d'y rester. Ainsi, même si quelques faux comptes peuvent exister au début (ce qui est déjà difficile car plus la WoT est petite, plus les membres sont proches), ces comptes tendent à être automatiquement exclus. Ainsi, il ne peut être garanti que de fausses identités n'existeront pas. Peut-être que les mathématiques pourraient nous y aider, mais nous (les initiateurs du projet uCoin) ne le savons pas encore (mais vous pourriez aider). Ce dont nous sommes sûrs, cependant, c'est que face au peu de faux comptes qu'il semble possible de créer, les inconvénients qui en résulteraient ne tiennent pas face aux bénéfices d'une monnaie libre et d'une économie libre.

source: ## uCoin for validators
fr_fr: ## uCoin pour les validateurs

source: ### What is a validator?
fr_fr: ### Qu'est-ce qu’un validateur ?

source: A validator is a person (more precisely, a member) participating to the writing of the blockchain.
fr_fr: Un validateur est une personne (plus précisément, un membre) qui participe à l'écriture de la blockchain.

source: Yes, just like Bitcoin and other altcoins, uCoin stores its data in a blockchain. A blockchain is a succession of blocks which are stacked, together, sequentially. Each block contains information about members & transactions. A chain of blocks gives 2 major informations, for any _t _time:
fr_fr: Oui, tout comme Bitcoin et autres altcoins, uCoin stocke ses données dans une blockchain. Une blockchain est une succession de blocs qui sont empilés ensembles de manière séquentielle. Chaque bloc contient des informations sur les membres et leurs transactions. Une blockchain donne deux informations majeures, pour tout instant t :

source: The Web of Trust state, giving us the information of who is member and received UD
fr_fr: L'état de la Toile de confiance, nous donnant l'information de qui est membre et a reçu le Dividende Universel

source: The Transactions state, telling who owns money and why (transaction history)
fr_fr: L'état des transactions, décrivant qui possède de la monnaie et pourquoi (l'historique des transactions)

source: ### Why to become a validator?
fr_fr: ### Pourquoi devenir validateur ?

source: First because for the currency to work, validators are required: they are the people _validating_ the blockchain, by writing new blocks on top of it. Since blocks define members & transactions, validators are those making the currency dynamic by allowing us creating new money and transfering it to someone else, or even receive money from others. Without validators, there _can't_ be currency.
fr_fr: D'abord, pour qu'une monnaie fonctionne, les validateurs sont requis : ce sont des gens qui _valident_ la blockchain, en écrivant des nouveaux blocs par dessus. Comme les blocs définissent les membres et les transactions, les validateurs sont ceux qui rendent la monnaie dynamique, nous permettant la création de nouvelle monnaie et son transfert vers les autres ou des autres vers nous-même. Sans validateurs, il ne __peut__ y avoir de monnaie.

source: ### Other motivations?
fr_fr: ### Autres motivations ?

source: Well, no. Motivation is to have a free currency working, because we know we want a _free_ currency.
fr_fr: Et bien non. La motivation est d'avoir une monnaie libre fonctionnelle, parce que nous voulons une monnaie libre.

source: ### Why not allowing non-member to write the blockchain?
fr_fr: ### Pourquoi ne pas permettre aux non-membres d’écrire la blockchain ?

source: Because then, we would loose the benefits from identification and would have to do old, energy wasting, centralizing power proof-of-work.
fr_fr: Parce qu'alors, nous perdrions les bénéfices de l'identification et nous devrions retourner à la vieille preuve de travail, gaspilleuse d'énergie et centralisant le pouvoir.

source: ### Where is stored uCoin data?
fr_fr: ### Où sont stockées les données uCoin ?

source: We first have the blockchain, which holds WoT and transactions. This blockchain is replicated on each validator's computer, and even on a simple observer wanting to store it (for whatever purpose). Secondly, we have private keys of people. Private keys are what allows people to create an identity, certify other people and finally create money from Universal Dividend. For both members & non-members, private keys allows for transaction handling. In such case, private key is just a synonym for "wallet".
fr_fr: Nous avons d'abord la blockchain, qui décrit la Toile de confiance et les transactions. Cette blockchain est répliquée sur l'ordinateur de chaque validateur, et même chez un simple observateur voulant la stocker (à toutes fins utiles). Deuxièmement, nous avons les clés privées de personnes. Les clés privées sont ce qui permet aux gens de créer une identité, de certifier d'autres personnes et, enfin, de créer de la monnaie sur la base du Dividende Universel. Pour les membres et non-membres, les clés privées permettent la gestion des transactions. Dans ce cas, la clé privée est juste un synonyme de "portefeuille".

source: ### Who may write blocks into the blockchain?
fr_fr: ### Qui peut écrire des blocs dans la blockchain ?

source: As said earlier, only members.
fr_fr: Comme dit précédemment, seulement les membres.

source: ### But if members say who are the members, how do we have first members?
fr_fr: ### Mais si les membres disent qui sont les membres, comment avons-nous les premiers membres ?

source: Very first members do not have to join the Web of Trust: they _are_ the WoT. Thereafter, newcomers may join in.
fr_fr: Les tout premiers membres ne doivent pas rejoindre la Toile de confiance : ils __sont__ la Toile de confiance. Par la suite, les nouveaux arrivants peuvent participer.

source: ### How is decided which member may write next block?
fr_fr: ### Comment est décidé quel membre peut écrire le bloc suivant ?

source: It is not decided, any member may write the next block. It is a matter of both chance and difficulty. Indeed, each members have a difficulty level _directly depending_ on the previous blocks he succeeded to validate. Hence, a member that do not validate much blocks will increase its chances to validate next one.
fr_fr: Cela ne se décide pas, tout membre peut écrire le prochain bloc. C'est en fonction à la fois de la chance et de la difficulté. En effet, chacun des membres à un niveau de difficulté directement fonction des blocs précédents qu'il a réussi à valider. Ainsi, un membre qui ne valide pas beaucoup de blocs augmentera ses chances de valider le prochain.

source: ### Does every member has to participate writing the blockchain?
fr_fr: ### Est-ce que chaque membre doit participer à écrire la blockchain ?

source: No, everyone is free.
fr_fr: Non, chacun est libre.

source: ### How to succeed writing next block?
fr_fr: ### Comment réussir à écrire le bloc suivant ?

source: A member has to pass a trial consisting in building a block whose fingerprint starts with a certain number of zeros. If he succeeds, he may send this block over the network for other members & non-members to accept it.
fr_fr: Un membre doit passer une épreuve consistant à construire un bloc dont l'empreinte commence avec un certain nombre de zéros. S'il réussit, il peut envoyer ce bloc sur le réseau pour que d'autres membres et non-membres puissent l'accepter.

source: ### How is difficulty computed?
fr_fr: ### Comment est calculée la difficulté ?

source: Precise rule is given in [the protocol](https://github.com/ucoin-io/ucoin/blob/master/doc/Protocol.md#proof-of-work). You should check it out, you will have a lot of technical informations about uCoin works!
fr_fr: La règle précise est donnée dans [le protocole](https://github.com/ucoin-io/ucoin/blob/master/doc/Protocol.md#proof-of-work). Vous devriez y jeter un œil, vous y trouverez beaucoup d'informations techniques sur le fonctionnement de uCoin !

source: ### What if 2 blocks get validated simultaneously?
fr_fr: ### Que faire si deux blocs se valident simultanément ?

source: uCoin will be able to handle multiple blockchains at the same time. So, 2 blocks validated at the same time will create a _fork_. Depending on other nodes of the network, one or the other of the 2 blockchains will be abandoned in the future.
fr_fr: uCoin sera en mesure de gérer plusieurs blockchains en même temps. Donc, 2 blocs se validant dans le même temps créeront un _fork_ (une séparation de la blockchain en plusieurs). Ce sont les autres noeuds du réseau qui décideront si l'une ou l'autre des 2 blockchains sera abandonnée à l'avenir.

source: ### Isn't there a risk a single member always succeed in proposing a valid block before others?
fr_fr: ### N’y a-t-il un risque qu’un seul membre réussisse systématiquement à proposer un bloc valide avant les autres ?

source: Yes, that's why when a member succeed to propose a block, his next blocks will require an harder work to be accepted. If he does not succeed for a while, the next blocks will be easier. And so on. Until a common floor.
fr_fr: Oui, voilà pourquoi quand un membre réussit à proposer un bloc, ses blocs suivants nécessiteront une épreuve plus difficile pour être acceptés. S'il ne réussit pas pendant un certain temps, les blocs suivants seront plus faciles, etc., jusqu'à un plancher commun.

source: ### How to know a member received the UD?
fr_fr: ### Comment savoir si un membre a reçu un Dividende Universel ?

source: If he was a member at that moment, he _did_ receive it. This is just an accepted rule.
fr_fr: S'il n'était pas membre à ce moment, il __ne l'a pas reçu__. Ceci est juste une règle acceptée.

source: ## Server software
fr_fr: ## Logiciel serveur

source: ### Which OS are supported?
fr_fr: ### Quels systèmes d’exploitation sont supportés ?
