Repository: duniter/blog-posts
Catalog: posts/2015-08-11-presentation.*.po
Languages: fr_fr

source: # Presentation
fr_fr: # Présentation

source: uCoin is a _cryptocurrency software_, which means it is a **sotfware** providing the ability to **create currencies**. uCoin is different from other cryptocurrency softwares you may know (Bitcoin, Litecoin, Peercoin, ...) for 2 main reasons : its **currency code** which includes both [Universal Dividend](https://en.wikipedia.org/wiki/Social_credit) & [Web of Trust](https://en.wikipedia.org/wiki/Web_of_trust) concepts, but also its **Blockchain code** which is far more energy efficient, putting away this massive energy waste introduced by Bitcoin.
fr_fr: uCoin est un logiciel de _crypto-monnaie_, c'est-à-dire qu'il s'agit d'un **logiciel** permettant de **créer des monnaies**. uCoin est différent des autres logiciels de crypto-monnaie que vous connaissez peut-être (Bicoin, Litecoin, Peercoin, ...) pour 2 raisons principales : son **code monétaire** qui inclut à la fois les concepts de [Dividende Universel](https://fr.wikipedia.org/wiki/Cr%C3%A9dit_social) et de [Toile de Confiance](https://fr.wikipedia.org/wiki/Toile_de_confiance), mais aussi son **code de Blockchain** qui est bien moins énergivore, solutionnant l'énorme gâchis d'énergie électrique introduit par Bitcoin.

source: ## Outline
fr_fr: ## Les grandes lignes

source: > **Any member is co-producer of the money** without doing anything, just for being a human of the monetary Community.
fr_fr: > **Tout membre est co-producteur de la monnaie** sans rien faire, juste pour être un humain de la Communauté monétaire.

source: This is where money comes from: every member regularly receives a Universal Dividend (i.e. monetary Basic Income) coming from new money directly issued by members and to members.
fr_fr: C'est de là que vient la monnaie : chaque membre reçoit régulièrement un Dividende Universel (c'est-à-dire un Revenu de Base) provenant de la nouvelle monnaie directement émise par les membres vers eux-même.

source: > **Any member needs signatures from other members** to join in or simply stay in the Community.
fr_fr: > **Tout membre a besoin de signatures provenant d'autres membres** afin de rejoindre ou simplement rester dans la Communauté monétaire.

source: Every member is _strongly identified_ through a Web of Trust mechanism to avoid one individual to receive multiple Universal Dividend through multiple identities. This implies a regular and renewed recognition of each member's identity so we are confident each individual is real and alive.
fr_fr: Chaque membre est *fortement identifié* à travers un mécanisme de « toile de confiance » pour éviter de recevoir de multiples dividendes universels grâce à de multiples identités. Cela implique une reconnaissance régulière et renouvelée de l’identité de chacun afin que la confiance en celui-ci soit réelle et vivante.

source: > **Data is fully distributed through the P2P network** to avoid any central power highly subject to corruption or Single Point of Failure issues.
fr_fr: > **Les données sont entièrement distribuées par le réseau de P2P** pour éviter toute centralisation très sujette à corruption ou point de défaillance unique.

source: Data is fully managed by the _P2P network_ so a free currency does not fall under few hands control and can stay a free currency.
fr_fr: Les données sont entièrement gérées par le *réseau P2P*, ainsi la monnaie ne tombe pas sous le contrôle de quelques mains et peut rester une monnaie libre.

source: ## A bit more
fr_fr: ## Plus de détails

source: ### Money is co-produced by all the community members
fr_fr: ### La monnaie est co-produite par tous les membres de la Communauté

source: This is the really main feature: money is _equally_ co-produced by the members of the community (a.k.a Web of Trust (WoT)). Such an equality is ensured in both space and time so that newcomers won't be excluded from money production process [like it can be seen with Bitcoin](http://magazine.ouishare.net/2013/05/bitcoin-human-based-digital-currency/), therefore **it won't be needed to create yet another Bitcoin currency to have your part of brand new money**. This co-production implies members to be identified in the software, and thus a mechanism to avoid people being able to create fake accounts for producing more money than others.
fr_fr: C'est réellement la fonction principale : la monnaie est co-produite *de manière égale* par les membres de la communauté (aussi connue sous le nom de Toile de Confiance (TdC)). Une telle égalité est assurée à la fois dans l'espace et dans le temps de manière à ce que les nouveaux venus ne soient pas exclus du processus de production de la monnaie [comme on peut malheureusement l'observer avec Bitcoin](http://magazine.ouishare.net/fr/2013/07/game-over-bitcoin-monnaie-virtuelle/), et donc **il ne sera pas nécessaire de créer un énième cousin de Bitcoin pour bénéficier de votre part de nouvelle monnaie**. Cette co-production implique toutefois que les membres soient identifiés dans le logiciel, et donc un mécanisme pour empêcher les individus de créer plusieurs comptes afin de produire plus de monnaie que les autres.

source: ### No more CPU race: an energy efficient Blockchain
fr_fr: ### La fin d'une course au processeur : une Blockchain efficace énergétiquement

source: Classical blockchains uses CPU power for addressing security issues. Even if it works (at least, it seems to), this is a very energy costly process. uCoin bet it is possible to have a similar but _more efficient_ _process_, which is not the little brother Proof-of-Stake (the power by the richers). uCoin benefits from a particular resource to reach this goal: **its identified community, its members**. Here is how uCoin Blockchain is built: each block is computed exclusively by members. Which means neither super Google nor any super powered group would be able to control the chain. Moreover, uCoin adds a rotation rule meaning **a member cannot control the blockchain alone**. A group of users could, but this would imply their computing power to be higher than the whole remaining members of the network. This is where Web of Trust comes into place: each member is recognized (its identity is trusted - not its acts) if he fits the WoT rules:
fr_fr: Les blockchains classiques utilisent la puissance CPU pour résoudre des problèmes de sécurité. Même si cela fonctionne (en tout cas, il semble que oui), c'est un processus coûtant très cher d'un point de vue énergétique. uCoin parie qu'il est possible d'avoir un processus similaire mais *bien plus efficace* énergétiquement, qui ne soit pas non plus le petit frère de la Preuve de Travail aussi nommé "Preuve de possession" (le pouvoir par les riches). uCoin bénéficie d'une ressource particulière pour atteindre ce but : chaque bloc est calculé exclusivement par les membres. Cela signifie que ni super-Google ni aucun groupe au supers pouvoirs ne serait capable de prendre le contrôle de la blockchain. De plus, uCoin ajoute un règle de rotation afin qu'**un membre seul ne puisse pas prendre le contrôle non plus**. Un groupe d'utilisateurs le pourrait, mais cela impliquerait que leur puissance de calcul serait plus élevée que le reste de la communauté de membres connectée au réseau. C'est ici qu'intervient la Toile de Confiance : chaque membre est reconnu (nous avons confiance en son identité, pas spécialement ses actes) s'il remplit les règles de la TdC :

source: the members must have enough signatures (links) from other members
fr_fr: le membre doivent avoir assez de signatures (liens) des autres membres

source: the member is close enough from any other member
fr_fr: le membre doit être assez proche de chaque autre membre

source: given the facts that:
fr_fr: sachant que :

source: signatures expire (the have a validity duration)
fr_fr: les signatures expirent (elles ont une durée de validité)

source: a given link must see a delay before being replayed
fr_fr: a lien donné doit observer un délai avant de pouvoir être rejoué

source: a member must wait a delay between each signature he makes (like a week)
fr_fr: un membre doit observer un délai entre chaque signature qu'il effectue (ex. : une semaine)

source: a member have a limit in the number of links he can make to others
fr_fr: un membre a une limite dans le nombre de liens qu'il peut faire vers les autres

source: links cannot be made in the future
fr_fr: les liens ne peuvent pas être écris dans le futur

source: links cannot be made too far in the past
fr_fr: les liens ne peuvent pas être écrits trop loin dans le passé

source: These rules are what reasonably ensures very most of the WoT is composed of unique and living individuals. Depending on the currency parameters, these rules may become either very hard or very easy to pass. For example, if each member must be directly signed by every other member (distance = 1), then it won't be possible to have fake accounts (unless everyone agrees with that). But such a community would be small. In the opposite, a distance of 5 would mean it exists a path of 5 links between 2 members (from one to the other). This would be much easier, making a wider community, but making fake accounts easier too. This is all a matter of which parameters are used for which maximum community size.
fr_fr: Ces règles sont ce qui permet raisonnablement de s'assurer que la grande majorité de la Toile de Confiance soit composée d'individus vivants et uniques. Selon les paramètres de la monnaie, ces règles peuvent devenir aussi bien faciles que très difficiles à passer. Par exemple, si chaque membre doit être directement signé par chaque autre membre (distance = 1), alors il ne sera pas possible d'avoir de faux comptes (à moins que chacun soit d'accord avec cela). Mais une telle communauté sera forcément très réduite. A l'opposé, une distance de 5 signifierait qu'il existe un chemin de 5 liens entre toute paire de membre (de l'un vers l'autre). Cela serait une communauté plus grande et bien plus facile à réaliser, mais les faux comptes le seraient également. C'est là toute la difficulté de choisir les bons paramètres pour une taille maximale de communauté.

source: ## Want more details?
fr_fr: ## Plus de détails ?

source: To get deeper in uCoin's concepts, check the [Theoretical](http://blog.ucoin.io/theoretical/ "Theoretical") page.
fr_fr: Pour aller plus loin dans les concepts de uCoin, faites un tour du coté de la [Théorie](http://duniter.org/theoretical/).
