Repository: duniter/blog-posts
Catalog: posts/2015-06-09-recap-of-the-5th-fmm-4-days-focusing-on-money-systems.*.po
Languages: fr_fr

source: # Recap of the 5th FMM: 4 days focusing on money systems!
fr_fr: # Récapitulatif des 5èmes Rencontres des Monnaies Libres : 4 jours intenses sur les systèmes monétaires !

source: There we are! **5th FMM is now over**. It has been [a very rich experience of 4 days](http://blog.ucoin.io/ucoin-at-the-5th-freedom-money-meeting/ "uCoin at the 5th Freedom Money Meeting") focusing on money systems. Below is quick recap of what happened during these days for those of you who could not be here with us! ## First day: a dive into uCoin protocol
fr_fr: Ça y est ! Les **5èmes Rencontres des Monnaies Libres sont terminées**. Cela a été une [très riche expérience de 4 jours](http://blog.ucoin.io/ucoin-at-the-5th-freedom-money-meeting/) à se concentrer sur les systèmes monétaires. Voici ci-dessous un récapitulatif rapide de ce qui s'est passé durant ces jours pour ceux d'entre-vous qui ne sont pas venus ! ## Premier jour : plongeon dans le protocole uCoin

source: The very first day was a presentation made by your servitor (cgeek) about uCoin software & protocol. This was a travel across technical details about how is uCoin working, which are the rules and what is the life of currency propulsed by uCoin protocol.
fr_fr: Le tout premier jour était une présentation faite par votre serviteur (cgeek) à propos du logiciel uCoin et de son protocole. Nous nous sommes intéressés aux détails techniques sur le fonctionnement de uCoin, sur les règles qui régissent sont protocole monétaire.

source: The presentation was in French, but I took the time to translate it in case you wanted to read it. You can dowload the file here: [FMM5\_Presentation\_en](/files/FMM5_Presentation_en.odp "FMM5 uCoin presentation by cgeek").
fr_fr: La présentation était en Français, vous pouvez la retrouver ici : [Presentation_FMM5.odp](/files/Presentation_FMM5.odp).

source: ## Second day: more about CuteCoin & uCoinApps softwares!
fr_fr: ## Deuxième journée : les logiciels CuteCoin & uCoinApps !

source: This day was an opportunity for client softwares to be presented. Let's see the two firsts: *CuteCoin* and *uCoinApps*. ### Cutecoin
fr_fr: Cette journée était une opportunité pour les logiciels client d'être présentés. Voyons les 2 premiers : *CuteCoin* et *uCoinApps*. ### CuteCoin

source: The morning was dedicated to [Cutecoin](https://github.com/ucoin-io/cutecoin), the very first client of uCoin software. We steped through:
fr_fr: La matinée était dédiée à [CuteCoin](https://github.com/ucoin-io/cutecoin), le tout premier client du logiciel uCoin. Nous avons vu :

source: Current state of the application
fr_fr: L'état actuel de l'application

source: Work to be done
fr_fr: Le travail restant à effectuer

source: Development process (unit tests, continuous integration)
fr_fr: Le processus de développement (tests unitaires, intégration continue)

source: And incoming features
fr_fr: Et les fonctionnalités à venir

source: Currently, Cutecoin allows you to do all the core operations made possible by uCoin software. It is also the first allowing to have an overview of the network!
fr_fr: Dès à présent, CuteCoin vous permet de réaliser tout les opérations de base proposées par le logiciel uCoin. C'est aussi le premier à proposer une vue du réseau !

source: <center> ![Web of Trust view from cgeek to inso](/content/images/2015/08/Capture-du-2015-06-09-21-38-05.png) <i>Web of Trust view from cgeek to inso</i> </center> <center> ![Overview of the meta_brouzouf currency network](/content/images/2015/08/network2.png) <i>Overview of the meta_brouzouf currency network</i> </center>
fr_fr: <center> ![Vue de la Toile de Confiance de cgeek vers inso](/content/images/2015/08/Capture-du-2015-06-09-21-38-05.png) <i>Vue de la Toile de Confiance de cgeek vers inso</i> </center> <center> ![Vue d'ensemble du réseau de la monnaie meta_brouzouf](/content/images/2015/08/network2.png) <i>Vue d'ensemble du réseau de la monnaie meta_brouzouf</i> </center>

source: The presentation is also available for download here: [FMM5 Cutecoin Presentation (fr)](/files/FMM5 Cutecoin Presentation \(fr\).odp).
fr_fr: La présentation est aussi disponible au téléchargement ici : [FMM5 Cutecoin Presentation (fr)](/files/FMM5 Cutecoin Presentation \(fr\).odp).

source: The afternoon was dedicated to uCoinApps, the little brother of Cutecoin as it is the second client for uCoin. uCoinApps is an Android application that allows you to:
fr_fr: L'après-midi était dédiée à uCoinApps, le petit frère de CuteCoin étant donné qu'il s'agit du second client de uCoin. uCoinApps est une application Android qui vous permet de :

source: Connect to an existing currency network
fr_fr: vous connecter à un réseau monétaire existant

source: Create your personal account
fr_fr: créer votre compte personnel

source: Publish your identity
fr_fr: publier votre identité

source: Certificate other members
fr_fr: certifier d'autres membres

source: See your account's balance
fr_fr: voir l'état de votre compte

source: Transfer money
fr_fr: transférer de la monnaie

source: The application is available on [Google Play](https://play.google.com/store/apps/details?id=io.ucoin.ucoin). You may also find [a tutorial (french)](http://www.ucoin.fr/utiliser/ucoinapps-android/) for using it at [ucoin.fr](http://ucoin.fr).
fr_fr: L'application est disponible sur [Google Play](https://play.google.com/store/apps/details?id=io.ucoin.ucoin). Vous pouvez aussi trouver [un tutoriel en français](http://www.ucoin.fr/utiliser/ucoinapps-android/) pour l'utiliser sur le site web [ucoin.fr](http://ucoin.fr).

source: The author of the application also made a presentation avaialble for download: [FMM5 uCoinApps Presentation (fr)](/files/FMM5-uCoinApps-Presentation-fr.odp).
fr_fr: L'auteur de l'application a également réalisé une présentation disponible au téléchargement : [FMM5 uCoinApps Presentation (fr)](/files/FMM5-uCoinApps-Presentation-fr.odp).

source: ## Third day: simulation of 160 years of money systems
fr_fr: ## Troisième jour : simulation sur 160 ans de différents systèmes monétaires

source: This day was an opportunity for non-developers to discover a french game called [La Corbeille](http://www.valeureux.org/blog/les-jeux/jeu-la-corbeille/). This game consists in simulating an **economy** by producing values using the only available currency system. The goal is to understand the underlying code of a currency system and see the consequences of using it. During this session, we have tried 2 money systems:
fr_fr: Ce jour était l'opportunité pour les non-développeurs de découvrir un jeu français nommé [La Corbeille](http://www.valeureux.org/blog/les-jeux/jeu-la-corbeille/). Ce jeu consiste en la simulation d'une **économie** en produisant des valeurs via le système monétaire disponible. Le but est de comprendre le code monétaire sous-jacent et de voir les conséquences de son utilisation. Durant cette session, nous avons essayé 2 systèmes monétaires :

source: Debt Money system (the one used by almost all currencies over the world, including € and $) in the morning
fr_fr: Le système de monnaie-dette (celui utilisé par toutes les monnaies du monde, incluant donc l'€ et le $) le matin

source: Freedom Money system (the one used by uCoin) in the afternoon
fr_fr: Le système de Monnaie Libre (celui réalisé par uCoin) l'après-midi

source: The results of this session are available for download on GitHub: [LibreOffice Calc file](https://github.com/galuel/Geconomicus/raw/master/Exemple_de_suivi_tableur.ods). Also, you can access the project [Ğeconomicus](https://github.com/galuel/Geconomicus) which provides a set of free graphics & tools to create your own economy simulations based on 80 years human lifetime. Here is a recap video of this journey (french), so as another resume on [creationmonetaire.info](http://www.creationmonetaire.info/2015/06/video-geconomicus-la-corbeille-aux-5emes-rencontres-des-monnaies-libres.html) :
fr_fr: Les résultats de cette session sont disponibles au téléchargement sur GitHub : [fichier LibreOffice Calc](https://github.com/galuel/Geconomicus/raw/master/Exemple_de_suivi_tableur.ods). Vous pouvez également accéder au projet [Ğeconomicus](https://github.com/galuel/Geconomicus) qui fournit un ensemble d'images et d'outils libres et gratuits pour créer vos propres simulations d'une économie sur la base d'une espérance de vie des hommes de 80 ans. Voici une vidéo récapitulative en français de cette journée, ainsi qu'un autre résumé sur [creationmonetaire.info](http://www.creationmonetaire.info/2015/06/video-geconomicus-la-corbeille-aux-5emes-rencontres-des-monnaies-libres.html) :

source: ## Fourth day: non-technical contributions
fr_fr: ## Quatrième jour : contributions non-techniques

source: A last day was dedicated to other contributions than coding. These are more around the project, for example explanations, theoretical fundamentals, etc.
fr_fr: Un dernier jour était dédié aux contributions dites non-techniques, c'est-à-dire ne traitant pas du code logiciel.

source: ### A new mathematical demonstration
fr_fr: ### Une nouvelle démonstration mathématique

source: The morning has seen the demonstration by Stéphane Laborde, the author of the RTM (Relativity Theory of Money), that a currency with a given rate of money creation and providing a Basic Income to its people by using a tax **have an equivalent Freedom currency** that only uses money creation. This mathematical demonstration can be found in the last version of the RTM in this file: [Relativity Theory of Money (french)](http://trm.creationmonetaire.info/TheorieRelativedelaMonnaie.pdf).
fr_fr: La matinée fut le théâtre d'une nouvelle démonstration de Stéphane Laborde, l'auteur de la Théorie Relative de la Monnaie (TRM), qui stipule qu'une monnaie en expansion qui assurerait le Revenu de Base à travers une taxe **a un équivalent en Monnaie Libre**, c'est-à-dire une monnaie uniquement en expansion mais sans aucune taxe. Cette démonstration mathématique peut être trouvée dans la dernière version de la TRM dans ce fichier : [Théorie Relative de la Monnaie](http://trm.creationmonetaire.info/TheorieRelativedelaMonnaie.pdf).

source: ### Presentation of David Chazalviel: "The RTM in color" and "The RTM for the kids"
fr_fr: ### Présentation de David Chazalviel : "La TRM en couleur" et "La TRM pour les enfants"

source: [David Chazalviel](http://cuckooland.free.fr/index.html) gave us a presentation about his 2 last contributions for spreading about Freedom Money:
fr_fr: [David Chazalviel](http://cuckooland.free.fr/index.html) a réalisé une présentation de ses 2 dernières contributions pour communiquer à propos des Monnaies Libres :

source: **The RTM in color** ([english](http://cuckooland.free.fr/TheRtmInColor.html) or [french](http://cuckooland.free.fr/LaTrmEnCouleur.html) version) is a brilliant web application to simulate and explore the concepts of a Freedom Money.
fr_fr: **La TRM en couleur** [en français](http://cuckooland.free.fr/LaTrmEnCouleur.html) est une superbe application web pour simuler et explorer les concepts de la Monnaie Libre.

source: **The RTM for the kids** (available in [french](http://cuckooland.free.fr/LaTrmPourLesEnfants.html) only) is an interactive presentation trying to explain what is a Freedom Money and the RTM to kids, thanks to Elise and its fairy friend:
fr_fr: **La TRM pour les enfants** en [fraçais](http://cuckooland.free.fr/LaTrmPourLesEnfants.html) est une présentation interactive tentant d'expliquer ce qu'est une Monnaie Libre ainsi que la TRM à des enfants, grâce à Elise et son amie la Fée :

source: ### Subscription to metab_brouzouf currency
fr_fr: ### Inscriptions à la monnaie meta_brouzouf

source: The afternoon was the occasion for people to try Cutecoin and [subscribe to metab_brouzouf currency](http://forum.ucoin.io/t/subscribing-to-meta-brouzouf-testing-currency)! As you can see, we now are about 23 active members testing uCoin:
fr_fr: L'après-midi était l'occasion pour les personnes d'essayer CuteCoin et [s'inscrire à la monnaie meta_brouzouf](http://forum.ucoin.io/t/subscribing-to-meta-brouzouf-testing-currency) ! Comme vous pouvez le voir, nous sommes maintenant 23 membres actifs à tester uCoin :

source: And here is the currency overview:
fr_fr: Et voici une vue d'ensemble de la monnaie :

source: This 1st edition of 2015 FMM was a very successful meeting with a lot of new people met and introduced to money codes, many technical details were explained and **the very first client applications** Cutecoin & uCoinApps have been presented and tested by final users! What will await us for [next FMM in Valence during November 2015](https://www.google.fr/maps/place/Valence/@44.8679005,4.9135516,11z/data=!4m2!3m1!1s0x47f55799c63221c7:0x408ab2ae4bfb580)? Coming months will tell us, but be sure a lot of work is to be achieved until then!
fr_fr: Cette 1ère édition des Rencontres des Monnaies Libres 2015 fut un franc succès avec beaucoup de nouvelles personnes rencontrées et sensibilisées aux codes monétaires, beaucoup de détails techniques ont pu être expliqués et **les toutes premières applications clientes** CuteCoin et uCoinApps ont été présentées et testées par des utilisateurs finaux ! Que nous attend-il pour les [prochaines Rencontres des Monnaies Libres à Valence en Novembre 2015](https://www.google.fr/maps/place/Valence/@44.8679005,4.9135516,11z/data=!4m2!3m1!1s0x47f55799c63221c7:0x408ab2ae4bfb580) ? Les mois qui viennent nous le diront, mais soyez sûrs que beaucoup de travail est à accomplir d'ici là !
