Repository: duniter/blog-posts
Catalog: posts/2015-08-11-theoretical.*.po
Languages: fr_fr

source: # Theoretical
fr_fr: # La théorie

source: ## A cryptocurrency system
fr_fr: ## Un système de crypto-monnaie

source: uCoin uses the crypto-currency concept introduced by Bitcoin, which is to use cryptography features such as _signature_ to create digital currencies. uCoin fits in this definition, however it has completely different fundation principles than Bitcoin like Web of Trust and Universal Dividend to do _really_ better than Bitcoin. Actually, uCoin has a theoretical reference called [Relative Money Theory](http://vit.free.fr/TRM/en_US/). This theory **demonstrates** that a currency which aims at respecting each individual's economic liberties MUST implement the Universal Dividend (aka. _Basic Income_), which is the only way to avoid both spatial and temporal asymmetry toward money issuance.
fr_fr: Duniter utilise le concept de crypto-monnaie introduit par Bitcoin. Le principe est d'utiliser des fonctionnalités de cryptographie telle que la signature afin de créer des devises numériques. Duniter rentre dans cette définition, mais a des principes totalement différents de Bitcoin comme la toile de confiance et le dividende universel. En fait, uCoin a une référence théorique appelée Théorie Relative de la Monnaie (TRM) que vous trouverez détaillée ici: http://trm.creationmonetaire.info. Cette théorie démontre qu'une monnaie qui vise à respecter les libertés économiques de chaque individu doit mettre en œuvre le Dividende Universel (aka. Revenu de base). Ceci est la seule façon d'éviter les asymétries spatiale et temporelle de l'émission de la monnaie.

source: ## A space-time asymmetry
fr_fr: ## Une asymétrie spatio-temporelle

source: Space-time asymmetry refers to the relative access of individuals to newly created money. Concretely, all existing currencies (2015) are both spatially and temporally asymmetrical for their users. Let's take Bitcoin example to understand why.
fr_fr: L'asymétrie spatio-temporelle se réfère à l'accès relatif des individus à la monnaie nouvellement créée. Concrètement, toutes les monnaies existantes (2015) sont à la fois spatialement et temporellement asymétriques pour leurs utilisateurs. Prenons par exemple le Bitcoin afin de comprendre pourquoi.

source: ### Spatially
fr_fr: ### Spatialement

source: When new Bitcoins are created, _only some Bitcoin users_ (the miners) are credited of brand new Bitcoins, while the others get nothing. **We believe this is the first injustice.** However, some might say:
fr_fr: Lorsque de nouveaux BTC sont créés, _seuls certains utilisateurs_ (les mineurs) sont crédités, tandis que les autres membres de la communauté ne reçoivent rien. **Nous pensons que ceci est la première injustice.** Cependant, certains pourraient dire :

source: > <div class="ui message">« but miners used their electricity and time to get it! »</div>
fr_fr: > <div class="ui message">« Mais les mineurs utilisent de l’électricité et du temps pour obtenir ces BTC! »</div>

source: ... we would answer this work _shouldn't have been rewarded by newly created Bitcoins_. New Bitcoins should spread the whole Bitcoin community. Miners should be rewared another way, not by money issuance. Of course, Bitcoin can't create money through Basic Income since Bitcoin users are not strongly identified, and one might benefit multiple times of money creation if he owned several wallets. uCoin get rid of this problem in its conception by identifying its users and giving _the same amount to everyone_.
fr_fr: À cela, nous répondrions que ce travail _ne doit pas être récompensé par les BTC nouvellement créés_. Les nouveaux BTC devraient être répartis dans toute la communauté. Les mineurs devront être récompensé d’une autre façon. Bien sûr, Bitcoin ne peut pas créer de la monnaie grâce au revenu de base puisque les utilisateurs ne sont pas fortement identifiés. En possédant plusieurs portefeuilles, ils pourraient bénéficier plusieurs fois de la création de monnaie. uCoin se débarrasse de ce problème dans sa conception par l'identification de ses utilisateurs, ce qui permet de donner _le même montant à tout le monde_.

source: ### Temporally
fr_fr: ### Temporellement

source: Bitcoin has a planned limit of 21 million BTC, which means less and less bitcoins will be created over the time until 0 remains. So, once first adopters will have mined every bitcoin, how will future joiners do to get bitcoins? Answer is: just like Euros or Dollars. To get money you have to work for the ones who already own it. **We believe this is the second injustice.** Every member of a monetary community should be equal towards money issuance, and get the same relative amount of new money over the time, _even if he is a later adopter_. uCoin aims at fixing this bug too by making Universal Dividend _grow by the time_ according to precise rules allowing members equality toward money issuance on a half-lifespan.
fr_fr: Bitcoin a une limite prévue de 21 millions de BTC. Cela signifie que de moins en moins de monnaie est créée au fil du temps (jusqu'à plus du tout). Ainsi, une fois que les premiers arrivants auront exploité chaque BTC, comment feront les suivants pour obtenir des BTC ? La réponse est: tout comme pour les euros ou les dollars. Pour obtenir de la monnaie, vous devrez forcément travailler pour ceux qui en possèdent déjà, ce qui ne permet pas de commencer son activité économique librement. **Nous pensons que c’est la seconde injustice.** Chaque membre d'une communauté monétaire devrait être égal face à l'émission de la monnaie et en obtenir la même quantité relative au cours du temps, _même s'il adopte le système en cours de route_. uCoin tend à corriger ce défaut en faisant croître le Dividende Universel en fonction du temps selon des règles précises permettant aux membres d’obtenir une quantité égale de monnaie sur la période d’une demie vie.

source: ## A solution
fr_fr: ## Une solution

source: Idea is the following: Bitcoin has teached us _it is possible_ to create a currency system allowing both to create digital money and to exchange it without central authority. What we need to change is _the way money is issued_ so we finally has a symmetrical system. We need Bitcoin + Universal Dividend. But Universal Dividend _implies_ to have a community of identified people. This is where Web of Trust (WoT) comes into place: this concept, introduced by cryptography with OpenPGP format, allows us to identify people in a decentralized manner. It works this way: each one creates _a personal identity_, linked to its cyptographical certificate, which has to be confirmed by others members using their own cryptographic key. It is that simple: **people define by themselves who is part of the community and who is not.**
fr_fr: L’idée est la suivante: Bitcoin nous a enseigné _qu'il est possible_ de créer un système monétaire permettant à la fois de créer la monnaie numérique et de l'échanger sans autorité centrale. Qu'est-ce que nous devons changer _à la façon dont la monnaie est créée_ afin que nous ayons enfin un système symétrique ? Nous avons besoin de Bitcoin + le Dividende Universel. Mais le dividende universel _implique_ d'avoir une communauté de personnes identifiées. C’est ici qu’intervient la toile de confiance (Web of Trust = WoT). Ce concept, introduit par la cryptographie avec le format OpenPGP, nous permet d'identifier les membres d'une manière décentralisée. Il fonctionne de cette façon: chacun crée une _identité personnelle_, liée à son certificat cryptographique, qui doit être confirmée par les autres membres en utilisant leur propre clé de chiffrement. C’est aussi simple que cela : **les gens définissent par eux-mêmes, qui fait et qui ne fait pas partie de la communauté.**

source: > uCoin however won't use OpenPGP for its cryptographic features: Elliptic Curves will be used instead for the conciseness of its generated keys and the pratical advantages it results from. This involves for us to specify our own Web of Trust mechanisms, but we think it worths the pain.
fr_fr: > uCoin n'utilisera cependant pas OpenPGP pour ses fonctions cryptographiques mais plutôt les Courbes Elliptiques du fait de la concision des clés générées et les avantages pratiques qu'il en résulte. Cela implique pour nous de définir notre propre processus de génération de toile de confiance, mais nous pensons que cela en vaut la peine.

source: ### The Blockchain
fr_fr: ### La Blockchain

source: Bitcoin's blockchain mechanism is important for us for two main reasons: **synchronization and security**. uCoin will still use it to benefit from these two features. However, uCoin's blockchain is slightly different: it not only stores transactions but _community variations_ for defining the WoT. It also has a different _Proof-of-Work_ mechanism made possible by WoT definition, providing **a really much more energy efficient way** to compute the blockchain.
fr_fr: Le mécanisme de blockchain de Bitcoin est important pour nous, pour deux raisons principales: **la synchronisation et la sécurité**. uCoin l’utilisera aussi pour bénéficier de ces deux caractéristiques. Cependant, la blockchain de uCoin est légèrement différente : non seulement elle stocke les transactions, mais aussi _les variations de la communauté_ pour définir la toile de confiance. Elle dispose également d'un mécanisme différent de _preuve de travail_ (Proof-of-Work = PoW) rendu possible par définition de la WoT, offrant un rendement énergétique moyen vraiment meilleur pour calculer la blockchain.

source: #### Web of Trust
fr_fr: #### La toile de confiance (WoT)

source: The Web of Trust is to be written in our common document: the blockchain. Just the same way Bitcoin's transaction are written in Bitcoin's blockchain, but for identity of people. Thus, blockchain constitutes a _space-time referential_, where _space_ is represented by individuals and _time_ provided by blockchain units: the blocks. What we finally have is **wot(t)**: the community at a _t_ instant.
fr_fr: La toile de confiance (ou Web-Of-Trust) doit être écrite dans notre document commun : la blockchain. De la même manière que les transactions de Bitcoin sont écrites dans la blockchain de Bitcoin, l'identité de chaque personne est également inscrite. Ainsi, la blockchain constitue un _référentiel d'espace-temps_, où _l'espace_ est représenté par les individus et _le temps_ fourni par les unités de la blockchain : les blocs. Ce que nous avons au final est la **WoT(t)** : la communauté à un instant t.

source: #### Transactions
fr_fr: #### Les transactions

source: But that's not all: blockchain is also the place where _transactions_, the support of money, are sequentially stored and allow to define money ownership. For this part, uCoin really looks like Bitcoin: transactions take inputs (_a.k.a._ sources) and generate outputs. Transaction is a flow of money. However, in uCoin inputs may be:
fr_fr: La blockchain est aussi le lieu où les _transactions_, le support de la monnaie, sont stockées séquentiellement et permettent de définir la propriété de la monnaie. Pour cette partie, uCoin ressemble vraiment à Bitcoin : les transactions sont les intrants (les sources) et génèrent des sorties. La transaction est un flux de monnaie. Cependant, dans uCoin les entrées peuvent être :

source: money from another transaction [Bitcoin like]
fr_fr: la monnaie d'une autre transaction [comme Bitcoin]

source: money from a Universal Dividend [uCoin specific]
fr_fr: la monnaie d'un Dividende Universel [spécifique à uCoin]

source: As you can see, no _generation transaction_ exists in uCoin. This kind of transaction is replaced by _Universal Dividend input_. Outputs, on their side, are always public keys, and not necessarily WoT members' public keys: _companies_ may also have public key. This lead us to an important fact: **companies are also able to use the currency**.
fr_fr: Comme vous pouvez le voir, aucune _transaction de génération_ n'existe dans uCoin. Ce type d'opération est remplacé par le _dividende universel_. Les sorties, de leur côté, sont toujours des clés publiques, et pas nécessairement des clés publiques de membres : _les entreprises_ peuvent aussi avoir une clé publique. Cela nous conduit à un fait important: **les entreprises sont également en mesure d'utiliser la monnaie**.

source: > Do note carefully that, even if they may participate, **companies won't be able to create money**. Only individuals will able to do it. This is a very important point.
fr_fr: Notez soigneusement que, même si elles peuvent participer, **les entreprises ne peuvent pas créer de la monnaie**. Seules les personnes seront en mesure de le faire. Ceci est un point très important.

source: #### Proof of Work
fr_fr: #### La preuve de travail

source: Like any P2P crypto-currency system, uCoin has a way to synchronize its peers for writing its common document (the blockchain). However, uCoin's benefiting from a really different environment than other altcoins: **an identified Web of Trust**. This little difference has a tremendous impact: while Bitcoin has to make a **global trial** using CPU resource to avoid blockchain's hijacking by few people, uCoin has the possibility to rely on its members to write the blockchain: this allows us to both avoids the energy wasting problem introduced by PoW & easily sweep away the 51% attack in uCoin. Concretely, uCoin has a **personalized trial** for each of its members that is getting harder for the member who succeeds writing a block, while it is getting easier - until a given floor - for the others. This mechanism ensures a rotation in the blockchain's writing, while keeping the advantage of PoW for synchronizing the peers.
fr_fr: Comme tout système de crypto-monnaie P2P, uCoin a une façon de synchroniser ses pairs pour la rédaction de son document commun (la blockchain). Cependant, uCoin bénéficiant d'un environnement très différent de celui d'autres altcoins : **une toile de confiance identifiée**. Cette petite différence a un impact énorme : alors que Bitcoin doit faire un **challenge global** à l'aide de ressources CPU pour éviter le détournement de la blockchain par quelques personnes, uCoin a la possibilité de compter sur ses membres afin d'écrire la blockchain : cela nous permet à la fois d'éviter le problème du gaspillage d'énergie introduit par la preuve de travail et facilement balayer l'attaque de 51 dans uCoin. Concrètement, uCoin a un **challenge personnalisé** pour chacun de ses membres qui est de plus en plus difficile pour le membre qui réussit l'écriture d'un bloc, alors qu'il devient plus facile - jusqu'à un plancher donné - pour les autres. Ce mécanisme assure une rotation dans l'écriture de la blockchain, tout en gardant l'avantage de la preuve de travail pour synchroniser les pairs.

source: > It can be noted too that, since a block does not provide extra money creation, members won't be pushed into competing for writing next block.
fr_fr: > On peut enfin noter que, comme calculer un bloc n'est pas récompensé par la création de monnaie supplémentaire, les membres ne seront pas poussés dans la concurrence pour l'écriture du bloc suivant.

source: ### To summarize
fr_fr: ### Pour résumer

source: uCoin's blockchain can be compared to Bitcoin's blockchain: a great book tracing the history of each membership inside the Community along with the transactions of its users. With the blockchain, we have the **fundamental referential** of the [Relative Money Theory](http://vit.free.fr/TRM/en_US/) (humans), and the flow of transactions emitted by the currency users.
fr_fr: La blockchain de uCoin peut être comparé à la blockchain de Bitcoin : un grand livre retraçant l'histoire de chaque adhésion à l'intérieur de la Communauté, ainsi que les opérations de ses utilisateurs. Avec la blockchain, nous avons le **référentiel fondamental** de la [Théorie Relative de la Monnaie](http://trm.creationmonetaire.info) (les humains) et le flux des transactions émises par les utilisateurs de la monnaie.

source: ## A free economy
fr_fr: ## Une économie libre

source: The goal of all this is to allow people to participate to a _free economy_ thanks to a _free currency_. What is a free economy? [Relative Money Theory](http://vit.free.fr/TRM/en_US/) defines it through 4 economic freedoms:
fr_fr: Le but de tout cela est de permettre aux gens de participer à une économie libre grâce à une monnaie libre. Qu'est-ce qu'une économie libre ? La [Théorie Relative de la Monnaie](http://trm.creationmonetaire.info/) la définit à travers 4 libertés économiques :

source: **The freedom to choose your currency system**: because money should not be imposed
fr_fr: **La liberté de choisir son système monétaire** : parce que la monnaie ne devrait pas être imposée

source: **The freedom to access resources**: because we _all_ should have access to economic & monetary resources
fr_fr: **La liberté d'accès aux ressources** : parce que nous devrions tous avoir accès aux ressources économiques et monétaires

source: **The freedom to estimate & produce value**: because value is a purely relative to each individual, in space and time
fr_fr: **La liberté d'estimer et de produire de la valeur** : parce que la valeur est une notion relative à chaque individu, dans l'espace et le temps

source: **The freedom to trade with the money**: because we should not be limited by the avaible money supply
fr_fr: **La liberté d'échanger dans la monnaie** : parce que nous ne devrions pas être limités par le stock de monnaie disponible

source: Those 4 economic freedoms should be understood together, not exclusively. Plus, _"freedom"_ has to be understood as "_non-nuisance_". So here, _freedom_ does not mean the right to take all of a resource (like water source in a desert) so no more is available to the others. Now you get it, this is the goal: _free economy through free currency._
fr_fr: Ces quatre libertés économiques doivent être comprises ensemble, pas exclusivement. De plus, la «_liberté_» doit être comprise comme «_non-nuisance_». Donc ici, la liberté ne signifie pas le droit de prendre toutes les ressources (comme une source d'eau dans un désert) et qu'il n'y en ai plus à la disposition des autres. Maintenant vous comprenez quel est l'objectif : une _économie libre_ à travers des _monnaies libres_.
