Repository: duniter/blog-posts
Catalog: posts/2015-08-11-faq.*.po
Languages: fr_fr

source: At the moment, only GNU/Linux and MacOS X are supported, however the software should also work on Windows (but harder to install because of external dependencies). For now, Ubuntu 12.04 to 14.04 have been tested. But any recent GNU/Linux distribution should be able to do the job.
fr_fr: À l'heure actuelle, uniquement GNU/Linux et Mac OS X sont pris en charge, mais le logiciel devrait également fonctionner sur Windows (mais plus difficile à installer en raison de dépendances externes). Pour le moment, Ubuntu 12.04 à 14.04 ont été testés. Mais toute distribution récente de GNU/Linux devrait être en mesure de faire le travail.

source: ### Which softwares are required?
fr_fr: ### Quels logiciels sont nécessaires ?

source: uCoin relies on some external softwares, listed here:
fr_fr: uCoin repose sur certains logiciels externes, énumérés ici :

source: ### How to install uCoin?
fr_fr: ### Comment installer uCoin ?

source: Follow [Install](https://github.com/ucoin-io/ucoin/wiki/Install-uCoin-node) guide.
fr_fr: Suivez le [guide d'installation](https://github.com/ucoin-io/ucoin/wiki/Install-uCoin-node).

source: ### Do you plan to have a [Docker](https://www.docker.com/) installation?
fr_fr: ### Prévoyez-vous d’avoir une installation [Docker](https://www.docker.com/) ?

source: Yes we do.
fr_fr: Oui.

source: ## Getting involved
fr_fr: ## S’impliquer

source: ### How may I help?
fr_fr: ### Comment puis-je aider ?

source: You can help on project developement in many ways, depending your available time, energy and your profile. Please read below requirements and possibilities. If you feel comfortable with one these profiles, do not hesitate to [contact us at admin@ucoin.io](mailto:admin@ucoin.io).
fr_fr: Vous pouvez aider au développement du projet de nombreuses manières, selon votre temps disponible, votre énergie et votre profil. S'il vous plaît lisez ci-dessous les exigences et les possibilités. Si vous vous sentez à l'aise avec l'un de ces profils, n'hésitez pas à nous contacter par mail à [admin@ucoin.io](mailto:admin@ucoin.io).

source: #### As a backend developer
fr_fr: #### Comme développeur back-end

source: You may participate to uCoin server's development, which is the core software implementing UCP. You will need some technical skills:
fr_fr: Vous pouvez participer au développement du serveur uCoin, qui est le logiciel de base mise en œuvre de UCP. Vous aurez besoin de quelques compétences techniques :

source: Node.js development, lot of asynchronous JavaScript
fr_fr: Développement Node.js, beaucoup de JavaScript asynchrone

source: MongoDB database, trough Mongoose module
fr_fr: Base de données MongoDB, via le module Mongoose

source: If you are not affraid by those technologies, you can both start reading [HTTP API](https://github.com/ucoin-io/ucoin/blob/master/doc/HTTP_API.md) and [contact us](mailto:admin@ucoin.io).
fr_fr: Si vous n'êtes pas effrayé par ces technologies, vous pouvez à la fois commencer à lire [API HTTP](https://github.com/ucoin-io/ucoin/blob/master/doc/HTTP_API.md) et à nous contacter par mail à [admin@ucoin.io](mailto:admin@ucoin.io).

source: #### As a designer/frontend developer
fr_fr: #### Comme designer/développeur front-end

source: See this beautiful website? You want to improve it with new content, new design? Feel free to propose your skills, any help is welcome. What probably uCoin needs the most is: **a logo**!
fr_fr: Voyez-vous ce magnifique site web ? Vous voulez en améliorer le contenu, le design ? Sentez-vous libre de proposer vos compétences, toute aide est la bienvenue. Ce que uCoin a probablement le plus besoin est **un logo** !

source: #### As a mathematician
fr_fr: #### Comme mathématicien

source: uCoin protocol will use Graph Theory properties to build a Web of Trust of unique & living individuals. Even if uCoin team is made up of engineers/PhDs, Graph Theory is not something easy and we probably need experts in that domain. So, if Graph Theory is your every day life, **do not hesitate to come to us!**
fr_fr: Le protocole uCoin utilise les propriétés de la Théorie des Graphes pour construire une Toile de Confiance d'individus vivants et uniques. Même si l'équipe uCoin est composée d'ingénieurs et docteurs, la Théorie des Graphes n'est pas quelque chose de facile et nous aurions probablement besoin d'experts dans ce domaine. Donc, si la Théorie des Graphes est votre vie de tous les jours, **n'hésitez pas à venir nous voir !**

source: #### As a preacher
fr_fr: #### Comme apôtre

source: Well, here, you do not need us to do the job: speak about uCoin, make articles, share links, knowledge, experiences, whatever! No need to ask, simply do it!
fr_fr: Hé bien, ici, vous n'avez pas besoin de nous pour vous aider : parlez de uCoin, faites-en des articles, partagez des liens, des connaissances, peu importe ! Pas besoin de nous demander, faites, tout simplement !

source: ### What to learn first?
fr_fr: ### Qu’apprendre en premier ?

source: Well, if reached this paragraph reading the whole FAQ, you should have a rather good idea of what is uCoin. You could go deeper with [Theoretical section](http://ucoin.io/theoretical). From there, you should be able to talk about the project with a minimum of background. If you want to get deeper in uCoin, read [UCP](http://ucoin.io/specs), this is uCoin protocol. All what you need to know about technical IT stuff is there, even if not in a tutorial format. Last, you could try to read [RMT](http://www.wikiwand.com/fr/Th%C3%A9orie_relative_de_la_monnaie), which is the fundamental theory behind uCoin's way of creating new money.
fr_fr: Eh bien, si vous avez lu l'ensemble de la FAQ, vous devriez avoir une assez bonne idée de ce qu'est uCoin. Vous pouvez aller plus loin avec la [section théorique](http://www.ucoin.fr/theoretical/). De là, vous devriez être en mesure de parler du projet avec un minimum de connaissances. Si vous souhaitez obtenir plus d'informations sur uCoin, lisez [UCP](http://ucoin.io/specs), le protocole de uCoin. Tout ce que vous devez savoir sur la technique est là, même si ce n'est pas dans un format tutoriel. Enfin, vous pouvez essayer de lire la [TRM](http://www.wikiwand.com/fr/Th%C3%A9orie_relative_de_la_monnaie), qui est la théorie fondamentale derrière uCoin pour la création monétaire.

source: ### The best way to stay tuned?
fr_fr: ### La meilleure façon de rester à l’écoute ?

source: [Mailing List](https://groups.google.com/forum/?hl=fr#!forum/ucoin) for major events, [uCoin Forum](http://forum.ucoin.io/) for every day talking about development, events, questions & almost every subject. Last, you could join the chatroom with the bottom-right _Chat_ icon visible on each page of this website.
fr_fr: La [liste de diffusion](https://groups.google.com/forum/?hl=fr#!forum/ucoin) pour les grands événements, le [Forum uCoin](http://forum.ucoin.io/) pour parler de développement, des événements, des questions et de presque tous les sujets au quotidien. Enfin, vous pouvez rejoindre la salle de chat avec l'icône de chat en bas à droite visible sur chaque page de ce site.
